// Вивантажити код програми з файлу у вікно редактора
function readFile(input) {
  var reader = new FileReader();
  reader.onload = function(e) {
    codeEditor.setValue(e.target.result);
    codeEditor.refresh();
  };
  reader.readAsText(input.files[0]);  
}
var input = document.getElementById("select");

// Зберегти - завантажити код програми у файл на комп'ютері
function saveFile() {

	let fileNameToSaveAs = prompt("Веедіть ім'я файлу для збереження");	

	let textToWrite = codeEditor.getValue();
	let textFileAsBlob = new Blob([textToWrite], {type: "text/plain;charset=utf-8", endings: "transparent"});
		
	saveAs(textFileAsBlob,fileNameToSaveAs + ".alg");
	
}	
// Видалити код у вікні редактора
function reset() {
	let AreYouSure = confirm("Вилучити код у вікні редактора?");
	if (AreYouSure) {
		codeEditor.setValue("");
		codeEditor.refresh();
	}
}
// Очистити вікно графіки
function clearCanvas() {
		background(200);
}
// Очистити вікно консолі від повідомлень
function clearConsole() {
			
    document.getElementById("console").innerHTML = "";
			
}
// custom Animation - used RequestAnimationFrame

(function() {
    var lastTime = 0;
    var vendors = ['ms', 'moz', 'webkit', 'o'];
    for(var x = 0; x < vendors.length && !window.requestAnimationFrame; ++x) {
        window.requestAnimationFrame = window[vendors[x]+'RequestAnimationFrame'];
        window.cancelAnimationFrame = window[vendors[x]+'CancelAnimationFrame'] 
                                   || window[vendors[x]+'CancelRequestAnimationFrame'];
    }
 
    if (!window.requestAnimationFrame)
        window.requestAnimationFrame = function(callback, element) {
            var currTime = new Date().getTime();
            var timeToCall = Math.max(0, 16 - (currTime - lastTime));
            var id = window.setTimeout(function() { callback(currTime + timeToCall); }, 
              timeToCall);
            lastTime = currTime + timeToCall;
            return id;
        };
 
    if (!window.cancelAnimationFrame)
        window.cancelAnimationFrame = function(id) {
            clearTimeout(id);
        };
}());

//
// Робота з модальним вікном 
function clModal() {
	modal.style.display = "none";
	codeEditor.setValue(code);
	codeEditor.refresh();
}
var code;
function ex1() {
		code="вивести(\"=== Виконуємо обчислення ===\")\nвивести(\"додавання 1 + ...+ 10 = \", 1+2+3+4+5+6+7+8+9+10)\nвивести(\"факторіал 10 =\", 1*2*3*4*5*6*7*8*9*10)\nвивести(\"сума дробів = 1/2 + 1/4 + 1/5 =\", 1/2 + 1/4 + 1/5)\nвивести(\"сума квадратів = 3^2 + 4^2 = 5^2 =\", 3*3 + 4*4, \" = \", 5*5)\nвивести(\"великі числа = один трильйон ^ 2 =\", 10000000000 * 1000000000000)\nвивести(\"простіші великі числа =\", 2e12 * 3e12)\nвивести(\"10307 не є простим =\", 10307/11, \" * \", 11)\nвивести(\"15% від 12345 = \", 15/100*12345)\nвивести(\"Можуть бути неточні результати:\")\nвивести(\"при операціях з великими числами =\", 1234567890 * 1234567890)\nвивести(\"при діях з дробами: 1/2 + 1/3 + 1/6 =\", 1/2 + 1/3 + 1/6)\nвивести(\"з десятковими дробами: 0.1+0.1+0.1+0.1+0.1+0.1+0.1+0.1 =\", 0.1+0.1+0.1+0.1+0.1+0.1+0.1+0.1)\nвивести(\"та інших випадках: 3.2 - 0.3 =\", 3.2 - 0.3)";
		clModal()
}
function ex2() {
		code="a = 10\nb = 100\nвивести(\"Сума =\", a + b)\nвивести(\"Добуток =\", a * b)\nx = 4\ny = x*x - 9*x + 14\nвивести(\"x = \", x)\nвивести(\"y = x*x - 9*x + 14\")\nвивести(\"y = \", y)";
		clModal();
}
function ex3() {
		code="a = ввести(\"Коефіцієнт a: \")\nb = ввести(\"Коефіцієнт b: \")\nc = ввести(\"Коефіцієнт b: \")\nd = b*b - 4 * a * c\nякщо d < 0 то\n	вивести(\"Рівняння не має дійсних коренів\")\nінакше \n	x1 = (-b - sqrt(d)) / (2 * a)\n    x2 = (-b + sqrt(d)) / (2 * a)\n    якщо d = 0 то\n    	вивести(\"Рівняння має один корінь\")\n        вивести(\"x = \",x1)\n    інакше\n    	вивести(\"Рівняння має два корені\")\n        вивести(\"x1 = \",x1)\n        вивести(\"x2 = \",x2)\n    кін якщо\nкін якщо";
		clModal();
}
function ex4() {
		code="a = ввести(\"Перше число: \")\nb = ввести(\"Друге число: \")\nc = ввести(\"Третє число: \")\n// якщо a більше ніж b та c, то a є найбільшим\nякщо (a >= b AND a >= c) то\n    вивести(\"Найбільше з трьох: \", a)\nкін якщо\n  // якщо b більше ніж a та c, то b є найбільшим\nякщо (b >= a AND b >= c) то\n    вивести(\"Найбільше з трьох: \", b)\nкін якщо\n// якщо c більше ніж a та b, то c є найбільшим\nякщо (c >= a AND c >= b) то\n    вивести(\"Найбільше з трьох: \", c)\nкін якщо";
		clModal();
}
function ex5() {
		code="a = 28\nb = 42\n\nвивести(\"Спільні дільники \",a,\" і \",b)\n\nдля c від 1 до a\n     якщо (a mod c = 0) AND (b mod c = 0) то\n        вивести(c)\n     кін якщо\nкін для";
		clModal();
}
function ex6() {
		code="вивести(\"Таблиця значень функції y = 3*x*x - 7*x + 2\")\nвивести(\"на проміжку x = 0 .. x = 10\")\n\nдля x від 0 до 10\n    y = 3*x*x - 7*x + 2\n    вивести(\"y(\",x, \") = \", y)\nкін для";
		clModal();
}
function ex7() {
		code="РІК = ввести (\"Рік \")\nМІСЯЦЬ = ввести(\"Місяць \")\nДЕНЬ = ввести(\"День \")\n\n\nвивести(ДЕНЬ,\"/\", МІСЯЦЬ, \"/\", РІК)\n\nякщо (РІК mod 4 = 0) то\n    FEBMAX = 29\nінакше\n    FEBMAX = 28\nкін якщо\n\nM = МІСЯЦЬ\nD = ДЕНЬ\n\nякщо (M <1) OR (M >12) то\n     вивести(\"місяць не є дійсним\")\nінакше якщо (D <1) OR (D >31) то\n     вивести(\"день не є дійсним\")\nінакше якщо (D = 31) AND (M = 4 OR M = 6 OR M = 9 OR M = 11) то\n     вивести(\"у цьому місяці немає 31 числа\")\nінакше якщо (M = 2) AND (D > FEBMAX) то\n     вивести(\"у лютому лише \", FEBMAX, \" дні\")\nінакше\n     вивести(\"Така дата дійсна\")\nкін якщо";
		clModal();
}
function ex8() {
		code="МАКСИМУМ = 10\n\nСУМА = 0\n\nдля ЧИСЛО від 1 до МАКСИМУМ\n       СУМА = СУМА + ЧИСЛО\nкін для\n\nвивести(\"Сума всіх чисел від 1 до \", МАКСИМУМ, \" = \", СУМА)";
		clModal();
}
function ex9() {
		code="// Ця програма використовує \"Ератостенове сито\"\n// щоб отримати список простих числе менших 100.\n\nЧИСЛА = []\n\nдля N від 1 до 100\n    ЧИСЛА [N] = 0\nкін для\n\nдля P від 2 до 50\n    N = P * 2\n    поки N <= 100\n       ЧИСЛА [N] = 1\n       N = N + P\n    кін поки\nкін для\n\nвивести(\"Це прості числа менше 100\")\n\n для N від 2 до 100\n    якщо ЧИСЛА [N] = 0 то\n       вивести(N)\n    кін якщо\nкін для";
		clModal();
}
function ex10() {
		code="// Ця програма використовує алгоритм бінарного пошуку \n// щоб відшукати код, а потім друкує відповідну назву\n\n\nКОД = [1001,1002,1050,1100,1120,1180,1200,1400]\nНАЗВА = [\"яблука\", \"вишні\", \"персик\", \"банан\", \"інжир\", \"виноград\", \"оливки\", \"манго\"]\n\nвивести(\"Введіть код продукту, який ви хочете знайти\")\nПОТРІБНО = ввести(\"Код:\")\n\nНИЖНЄ = 0\nВЕРХНЄ = 7\nЗНАЙДЕНО = -1\n\nпоки (ЗНАЙДЕНО = -1) AND (НИЖНЄ <= ВЕРХНЄ)\n   СЕРЕДИНА =  (НИЖНЄ + ВЕРХНЄ) div 2  \n	\n   якщо КОД [СЕРЕДИНА] = ПОТРІБНО то\n       ЗНАЙДЕНО = СЕРЕДИНА\n   інакше якщо ПОТРІБНО < КОД [СЕРЕДИНА] то\n       ВЕРХНЄ = СЕРЕДИНА - 1\n   інакше\n       НИЖНЄ = СЕРЕДИНА + 1\n   кін якщо\nкін поки\n\nякщо ЗНАЙДЕНО >= 0 то\n     вивести(ПОТРІБНО, \": \", НАЗВА [ЗНАЙДЕНО])\nінакше\n     вивести(ПОТРІБНО, \"не знайдено\")\nкін якщо";
		clModal();
}
function ex11() {
		code="// алгоритм сортування вибором\n\nЧИСЛА = [15,30,85,25,40,90,50,65,20,60]\nвивести(\"перед сортуванням\")\nДРУК_ЧИСЕЛ()\n\nдля ПЕРШЕ від 0 до 9\n     ОСТАННЄ = ПЕРШЕ\n     для ПОТОЧНЕ від ПЕРШЕ+1 до 9\n         якщо ЧИСЛА [ПОТОЧНЕ] > ЧИСЛА [ОСТАННЄ] то\n            ОСТАННЄ = ПОТОЧНЕ\n         кін якщо\n     кін для\n     ТМЧ = ЧИСЛА [ОСТАННЄ]\n     ЧИСЛА [ОСТАННЄ] = ЧИСЛА [ПЕРШЕ]\n     ЧИСЛА [ПЕРШЕ] = ТМЧ\nкін для\n\n\nвивести(\"після сортування\")\nДРУК_ЧИСЕЛ ()\n\nфункція ДРУК_ЧИСЕЛ ()\n    для C від 0 до 9\n       вивести(ЧИСЛА [C])\n    кін для\n    вивести(\"=========\")\nкін функція";
		clModal();
}
function ex12() {
		code="// Простий, але неефективний, алгоритм сортування бульбашкою\n\nЧИСЛА = [15,30,85,25,40,90,50,65,20,60]\n\nвивести(\"перед сортуванням:\")\nдля C від 0 до 9\n    вивести(ЧИСЛА [C])\nкін для\n\nвивести(\"=========\")\n\nдля ВСІ від 0 до 8\n     для ПОТОЧНЕ від 0 до 8\n         якщо ЧИСЛА [ПОТОЧНЕ] < ЧИСЛА [ПОТОЧНЕ + 1] то\n           ТМЧ = ЧИСЛА [ПОТОЧНЕ]\n           ЧИСЛА [ПОТОЧНЕ] = ЧИСЛА [ПОТОЧНЕ + 1]\n           ЧИСЛА [ПОТОЧНЕ + 1] = ТМЧ\n         кін якщо\n     кін для\nкін для\n\nвивести(\"після сортування:\")\n\nдля C від 0 до 9\n    вивести(ЧИСЛА [C])\nкін для";
		clModal();
}
function ex13() {
		code="// Обернути список навпаки\nІМЕНА = [\"Андрій\", \"Борис\", \"Віталій\", \"Георгій\", \"Дмитро\"]\n\nN = 5 // кількість елементів у списку\nK = 0 // індекс першого елементу\nвивести(\"**Початковий список**\")\nдля C від 0 до N-1\n     вивести(ІМЕНА [C])\nкін для\n\nпоки K < N div 2\n     ТМЧ = ІМЕНА [K]\n     ІМЕНА [K] = ІМЕНА [N - K - 1]\n     ІМЕНА [N - K - 1] = ТМЧ\n     K = K + 1\nкін поки\nвивести(\"**Обернутий список**\")\nдля C від 0 до N-1\n     вивести(ІМЕНА [C])\nкін для";
		clModal();
}
function ex14() {
		code="// Розподіл частот\nДАНІ = [17,20,23,29,33,42,60,61,75,75,90,99]\nЧАСТОТА = [0,0,0,0,0,0,0,0,0,0]\n\nдля C від 0 до 11\n     ЗНАЧЕННЯ  = ДАНІ [C]\n     для F від 0 до 9\n         якщо ЗНАЧЕННЯ  >= 10*F AND ЗНАЧЕННЯ  <10*(F+1) то\n             ЧАСТОТА [F] = ЧАСТОТА [F] + 1\n         кін якщо\n     кін для\nкін для\n\nвивести(\"Дані\")\n\nдля D від 0 до 11\n     вивести(ДАНІ [D])\nкін для\n\nдля F від 0 до 9\n     вивести(\"Діапазон: \",F*10, \"-\", (F+1)*10, \", частота: \", ЧАСТОТА [F])\nкін для\n";
		clModal();
}
function ex15() {
		code="// Пошук дублікатів у списках\nВОЛЕЙБОЛ = [\"Андрій\", \"Борис\", \"Віктор\", \"Дмитро\", \"Євгеній\"]\nБАСКЕТБОЛ = [\"Антон\", \"Денис\", \"Микола\", \"Євгеній\", \"Лаврін\"]\n\nвивести(\"В обох списках присутній:\")\n\nдля В від 0 до 4\n     для Б від 0 до 4\n         якщо ВОЛЕЙБОЛ [В] = БАСКЕТБОЛ [Б] то\n             вивести(ВОЛЕЙБОЛ [В])\n         кін якщо\n     кін для\nкін для";
		clModal();
}
function ex16() {
		code="// Перевірка гіпотези Коллатца, ряд має закінчуватися 1\nЧИСЛО = 10\n\nпоки ЧИСЛО > 1\n  \n    вивести(ЧИСЛО)\n\n    якщо ЧИСЛО mod 2 = 0 то\n       ЧИСЛО = ЧИСЛО / 2\n    інакше\n       ЧИСЛО = ЧИСЛО * 3 + 1\n    кін якщо\n\nкін поки\n\nвивести(ЧИСЛО)";
		clModal();
}
function ex17() {
		code="// Додатнє чи від'ємне\nЧИСЛО = input(\"Введіть число: \")\n\nякщо ЧИСЛО > 0 то\n	вивести(ЧИСЛО, \" є додатнім\")\nінакше якщо ЧИСЛО = 0 то\n	вивести(ЧИСЛО, \" є 0\")\nінакше\n	вивести(ЧИСЛО, \" є від'ємним\")\nкін якщо";
		clModal();
}
function ex18() {
		code="// Найбільший спільний дільник\nфункція НСД(X, Y)\n	поки X <> Y\n    	якщо X > Y то\n        	X = X - Y\n        інакше\n        	Y = Y - X\n        кін якщо\n    кін поки\n    результат X\nкін функція\n\nвивести(НСД(128, 64))";
		clModal();
}
function ex19() {
		code="// Знаходження найменшого спільного кратного\na = input(\"Перше число: \")\nb = input(\"Друге число: \")\n\n//знаходження найбільшого спільного дільника\nфункція НСД(a, b)\n    поки a*b <> 0\n        якщо a >= b то\n            a = a mod b\n        інакше\n            b = b mod a\n        кін якщо \n    кін поки    \n    результат a + b            \nкін функція\n\n//Знаходимо найменше спільне кратне\nНСК = (a * b) div НСД(a, b)\nвивести (НСК)";
		clModal();
}
function ex20() {
		code="фон(\"синій\")\nколір(\"чорний\")\n\nзаповнення(\"жовтий\")\nколо(60, 60, 90)\n\nзаповнення(\"помаранчевий\")\nпрямокутник(100, 300, 350, 200)\n\nзаповнення(\"сірий\")\nпрямокутник(230, 360, 70, 140)\n\nзаповнення(\"блакитний\")\nпрямокутник(130, 378, 70, 60)\nпрямокутник(338, 378, 70, 60)\n\nзаповнення(\"коричневий\")\nтрикутник(100, 300, 260, 150, 450, 300)\n\nзаповнення(\"зелений\")\nпрямокутник(0, 490, 600, 50)\n";
		clModal();
}
function ex21() {
		code="фон(\"блакитний\")\nзаповнення(180)\nпрямокутник(0, 400, 500, 200)\n\n//snowman\nзаповнення(255)\nколо(250, 400, 200)\nколо(250, 275, 150)\nколо(250, 175, 100)\n\n//hat\nзаповнення(0)\nпрямокутник(215, 40, 70, 100)\nеліпс(250, 140, 100, 10)\n\n//eyes\nколо(235, 165, 5)\nколо(265, 165, 5)\n\n//carrot\nзаповнення(255, 165, 0)\nтрикутник(250, 175, 250, 185, 290, 200)\n\n//arms\nзаповнення(139, 69, 19)\nлінія(180, 260, 100, 245)\nлінія(320, 260, 400, 245)\n\n//scarf\nзаповнення(0, 0, 255)\nпрямокутник(205, 210, 90, 20)\nпрямокутник(205, 210, 20, 80)\n\n//buttons\nзаповнення(0)\nколо(250, 240, 7)\nколо(250, 270, 7)\nколо(250, 300, 7)\n";
		clModal();
}
function ex22() {
		code="фон(\"блакитний\")\nзаповнення(\"зелений\")\nпрямокутник(0,300,500,300)\nколір(\"червоний\")\nзаповнення(\"червоний\")\nчотирикутник(65,285, 65,260, 235,260, 235,285)\nчотирикутник(65,260, 100,255, 200,255, 235,260)\nчотирикутник(100,255, 115,235 ,185,235, 200,255)\n\nколір(\"чорний\")\nзаповнення(\"чорний\")\nколо(100,285,25) \nколо(200,285,25)\nколір(\"сірий\")\nзаповнення(\"сірий\")\nколо(100,285,12)  \nколо(200,285,12)\n\nтрикутник(106,255, 118,238, 118,255)\nтрикутник(194,255,182,238, 182,255)\n\nпрямокутник(121,238,27,17)\nпрямокутник(155,238,27,17)\n\n";
		clModal();
}
function ex23() {
		code="// Малюємо парусник\nфон(\"блакитний\")\nзаповнення(\"жовтий\")\nколо(400,50,50)\nзаповнення(\"червоний\")\nчотирикутник(50,200,250,200,200,230,100,230)\nзаповнення(\"білий\")\nтрикутник(90,180,150,80,150,190)\nтрикутник(155,50,220,190,155,190)\nзаповнення(\"синій\")\nпрямокутник(0,230,500,500)\n";
		clModal();
}
function ex24() {
		code="// Малюємо ялинку\nфон(\"синій\")\nзаповнення(\"зелений\")\nколір(\"зелений\")\nтрикутник(200,150,250,80,300,150)\nтрикутник(180,190,250,120,320,190)\nтрикутник(160,230,250,140,340,230)\nтрикутник(140,280,250,160,360,280)\nтрикутник(130,320,250,180,370,320)\nтрикутник(120,360,250,220,380,360)\nзаповнення(\"коричневий\")\nколір(\"коричневий\")\nпрямокутник(240,360,20,30)\nзаповнення(\"білий\")\nколір(\"білий\")\nпрямокутник(0,390,500,110)\nколір(\"синій\")\nзаповнення(\"жовтий\")\nколо(400,50,50)\nзаповнення(\"синій\")\nколо(390,60,50)\n";
		clModal();
}
function ex25() {
		code="// Малюємо різдвяну ніч\nфункція зірка(x, y)\n	заповнення(\"жовтий\")\n	колір(\"жовтий\")\n    чотирикутник(x, y+5, x+20,y, x+40, y+5, x+20,y+10)\n    чотирикутник(x+15, y+5, x+20,y-15, x+25, y+5, x+20, y+25)\nкін функція\n// початок програми\nфон(\"синій\")\n// малюємо 10 зірок\nдля КІЛЬКІСТЬ від 1 до 10\n	зірка(random(1,40)*10,random(2,30)*10)\nкін для\n// малюємо ялинку\nзаповнення(\"зелений\")\nколір(\"зелений\")\nтрикутник(200,150,250,80,300,150)\nтрикутник(180,190,250,120,320,190)\nтрикутник(160,230,250,140,340,230)\nтрикутник(140,280,250,160,360,280)\nтрикутник(130,320,250,180,370,320)\nтрикутник(120,360,250,220,380,360)\nзаповнення(\"коричневий\")\nколір(\"коричневий\")\nпрямокутник(240,360,20,30)\n// сніг\nзаповнення(\"білий\")\nколір(\"білий\")\nпрямокутник(0,390,500,110)\n//місяць\nколір(\"синій\")\nзаповнення(\"жовтий\")\nколо(400,50,50)\nзаповнення(\"синій\")\nколо(390,60,50)\n";
		clModal();
}

